[
  {
    "ID": "klingon-d7-class",
    "Name": "D7-class battlecruiser",
    "Affiliation": "Klingon Empire",
    "Category": "Ship class",
    "Era": "23rd century (TOS era; later legacy appearances)",
    "Tagline": "The classic Klingon warship silhouette—predatory wings, a forward command pod, and a reputation built on brinkmanship as much as firepower.",
    "AtAGlance": {
      "WhatFansRemember": [
        "The manta‑ray profile: wings flared, neck stretched, command pod like a snapping jaw",
        "A ship that can loom on screen and instantly turn a scene into a staring contest",
        "The K‑7 shore‑leave confrontation that spirals into tribble chaos",
        "Romulan operation of the same hull design in the late 2260s",
        "How instantly it “dates” a scene—one glance and you know you’re in classic-era Trek"
      ],
      "CrewComplement": "Often cited around ~430 personnel for a typical D7 (varies by ship and mission).",
      "TopSpeed": "Often summarized in reference material as warp 9+ for the era; on screen it’s treated as fast enough to matter in pursuit and interception.",
      "FleetRole": "Heavy battlecruiser / patrol / border pressure—sometimes used as a scout ship, just with teeth."
    },
    "WhyItMatters": {
      "InUniverse": "In the Kirk era, a D7 isn’t just a ship—it’s a political lever. It can arrive quickly, park where it shouldn’t, and force Starfleet to choose between escalation and humiliation. Even with weapons cold, it makes every hail feel like negotiations under pressure.",
      "InFranchiseHistory": "The D7 becomes visual shorthand for “Klingon warship,” like the Constitution-class becomes shorthand for “Starfleet hero ship.” Later Klingon designs evolve, but they keep echoing the D7’s DNA: posture, presence, and threat in silhouette."
    },
    "SignatureLook": {
      "Silhouette": "A wide, wing-like primary hull with nacelles tucked beneath the wings, a long neck, and a head-like forward command pod. It looks like it’s already leaning into the attack.",
      "PaintAndMarkings": "Klingon finishes read utilitarian and militarized. Romulan-operated variants are famously associated with bold bird‑of‑prey-style hull art in later presentations—same chassis, different identity."
    },
    "OnScreenCanon": {
      "FirstOnScreenUse": "The classic D7 filming model’s first aired appearance is as a Romulan battle cruiser in “The Enterprise Incident” (TOS).",
      "NotableCanonWindows": [
        "2260s: recurring Klingon warship presence in the original series era",
        "2268: Romulan-operated D7s appear during a tense alliance period",
        "2268: the K‑7 incident ties the D7 to one of Trek’s most memorable ‘tension + comedy’ episodes",
        "DS9 era: the D7 reappears as instant visual time-travel shorthand"
      ],
      "AnchorMomentsForFans": [
        {
          "Moment": "A Klingon D7 arrives at Deep Space Station K‑7 demanding shore leave—and the situation collapses into tribble disaster.",
          "WhyItSticks": "Peak tonal balance: real geopolitical tension sitting on top of absurd, unforgettable comedy."
        },
        {
          "Moment": "A D7 drops out of warp near Deep Space Nine in “Trials and Tribble‑ations.”",
          "WhyItSticks": "The silhouette alone sells the century shift before anyone explains what’s happening."
        },
        {
          "Moment": "Romulans operate the same hull in “The Enterprise Incident.”",
          "WhyItSticks": "A clean “same ship, new threat” twist that implies bigger politics off screen."
        }
      ]
    },
    "RoleAndDoctrine": {
      "HowItsUsed": [
        "Border intimidation: arrive close, hold position, force a response on Klingon terms",
        "Rapid force projection: fast enough to threaten, heavy enough to be respected",
        "Command presence: the ship’s look is part of the message",
        "Probing encounters: test readiness, force defensive reveals, punish hesitation"
      ],
      "WhatItSignalsWhenItShowsUp": [
        "A political test (will you flinch?)",
        "A tactical probe (will you expose defenses?)",
        "A hard threat (answer the lock… or accept the humiliation)"
      ]
    },
    "SystemsAndCapabilities": {
      "Weapons": {
        "Primary": [
          "Disruptor cannons (classic green disruptor fire on screen)",
          "Forward launcher associated with photon torpedoes in reference summaries"
        ],
        "HowItFights": "It pressures with forward arcs and decisive passes—forcing opponents to react, turn, and commit, then exploiting the moment they lose initiative."
      },
      "Defenses": {
        "Shields": "Standard defensive shielding for the era—strong enough to take a hit, not magical enough to ignore consequences.",
        "Cloaking": "Cloaking becomes strongly associated with D7-era storytelling through Romulan operation and later cloak plots."
      },
      "Propulsion": {
        "Warp": "Often summarized as warp 9+ in era context; portrayed as capable of high-speed pursuit and interception.",
        "Impulse": "Depicted as a steady sublight handler for a warship—built for control, not grace."
      },
      "MissionFlex": {
        "ScoutProfile": "Sometimes assigned as a ‘scout ship’—a reminder that in Klingon terms, reconnaissance doesn’t have to be subtle."
      }
    },
    "LifeAboard": {
      "Tone": "Utilitarian and war-focused—less ‘space cruise,’ more ‘armed camp that goes to warp.’",
      "Recreation": "The franchise doesn’t portray D7s as comfort-forward vessels; the vibe is discipline, readiness, and chain-of-command gravity.",
      "BridgeCulture": "A command space built around presence—when the captain speaks, the ship feels like it leans forward with them."
    },
    "NotableShipsAndSightings": [
      {
        "Name": "IKS Gr’oth",
        "ClaimToFame": "Koloth’s D7 at K‑7—shore leave demanded, tribbles acquired.",
        "PeopleConnected": [
          "Koloth",
          "Korax"
        ],
        "WhyFansCare": "It makes the D7 inseparable from one of the franchise’s most rewatchable Federation–Klingon stories."
      },
      {
        "Name": "IKS Klothos",
        "ClaimToFame": "Kor’s ship, tied to early cloak-era talk and later legend-building around Kor.",
        "PeopleConnected": [
          "Kor"
        ],
        "WhyFansCare": "Because it’s Kor’s ship—and Kor is basically walking Klingon history."
      }
    ],
    "BehindTheScenes": {
      "DesignIntent": "Designed to be instantly readable as an antagonist ship at a glance—recognizable even in a fast cut.",
      "VisualInspiration": "Jefferies aimed for a predatory ‘sea-life’ posture so it feels dangerous even in silhouette.",
      "ProductionTriviaForFans": [
        "The filming model’s first aired appearance is as a Romulan ship—one of Trek’s fun ‘production history becomes lore’ quirks.",
        "Later productions preserved the silhouette while adding surface detail so the ship still reads ‘classic’ without looking flat."
      ]
    },
    "FanNotes": {
      "IfYouOnlyReadOneThing": "The D7 is a tension switch. When it appears, the scene becomes pride, brinkmanship, and risk—because the ship itself is a dare.",
      "WhyItStillWorksToday": [
        "It’s readable—you can sketch it after seeing it once.",
        "It does narrative work with shape alone: menace without dialogue.",
        "It carries legacy: later Klingon ships feel like descendants, not replacements.",
        "It can play serious or comedic (K‑7) without losing credibility."
      ]
    },
    "Review": "The D7-class battlecruiser is the Klingon Empire’s most famous “hello,” and it’s never meant to be friendly. Its silhouette does half the storytelling: wings spread like a hunter’s stance, a narrow neck, and a forward command pod that reads as a head poised to strike. Even before a captain speaks, the ship communicates intent—pressure, pride, and a willingness to escalate.\n\nWhat makes the D7 so satisfying for fans is that it isn’t just a pile of specs; it’s a mood. When one appears, the scene changes shape. Starfleet’s optimism suddenly feels negotiable. Every hail becomes a test: do you answer politely, do you posture back, do you stand your ground, or do you maneuver in a way that looks like fear? The ship’s presence turns routine space into a stage.\n\nIt’s also a perfect “Klingon doctrine in miniature.” The D7 doesn’t need to be subtle. It arrives close, it holds position, it makes you react. The class is portrayed as fast enough to matter and heavy enough to demand attention—ideal for border pressure, rapid responses, and the kind of tactical probing where the real goal is to learn how an opponent thinks under stress.\n\nThen the franchise proves how iconic the D7 really is by letting it play against type—without losing credibility. The K‑7 incident is the ultimate example: a warship arrives as a diplomatic threat, and the episode pivots into tribble chaos. The joke works because the D7 is so deadly serious as an image; the comedy lands harder when it’s bouncing off something that looks like it was built for conquest.\n\nOne of the smartest uses of the design is the Romulan twist. Seeing the same hull under a different banner is instant subtext: alliances, bargains, and political debt you can feel without a speech explaining it. It’s a rare case where a production quirk becomes a storytelling advantage, because the audience’s recognition does the work.\n\nDecades later, the D7 still functions as pure visual time travel. Put that silhouette on screen and fans immediately know the era, the tone, and the stakes. That’s the real ‘spec’: readability. The D7 isn’t just remembered—it’s useful, a piece of Star Trek’s visual language that can trigger tension (or nostalgia) in a single shot.",
    "Notes": "If you want one ‘classic Klingon’ entry to anchor a ships library, the D7 is it: war, politics, reputation, and legacy—sometimes without firing a shot.\n\nFor fans, the fun is how many different kinds of Trek stories it supports. In a straight confrontation, a D7 makes Starfleet’s confidence feel earned rather than assumed—because you can’t talk your way out of a weapons lock. In a diplomacy episode, it becomes the visual embodiment of brinkmanship: the ship isn’t attacking, it’s daring you to misstep.\n\nAnd then there’s the tonal whiplash that only Star Trek pulls off: a D7 can walk into an episode as a credible threat and walk out as the most famous unwilling carrier of tribbles in the quadrant. That contrast doesn’t weaken the design—it strengthens it, because the ship remains formidable even when the plot turns absurd.\n\nWhen you expand this library, the D7 is also a great ‘bridge’ entry: it links the TOS era to later nostalgia hits, it connects Klingon doctrine to Romulan political twists, and it gives you a baseline for comparing later Klingon ships—what changed, what stayed, and what the silhouette still tells the audience at a glance.",
    "ImageURL": "https://raw.githubusercontent.com/BigBird7827/Shi-Trek/main/Images/Klingon%20D7%20(Final).png"
  },
  {
    "ID": "uss-enterprise-ncc-1701",
    "Name": "USS Enterprise (NCC-1701)",
    "Affiliation": "Federation",
    "Category": "Starship",
    "Era": "23rd century (TOS era)",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "uss-enterprise-ncc-1701-a",
    "Name": "USS Enterprise (NCC-1701-A)",
    "Affiliation": "Federation",
    "Category": "Starship",
    "Era": "23rd century (films era)",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "uss-enterprise-ncc-1701-d",
    "Name": "USS Enterprise (NCC-1701-D)",
    "Affiliation": "Federation",
    "Category": "Starship",
    "Era": "24th century (TNG era)",
    "Tagline": "The Galaxy-class flagship that turned exploration into a lived-in place—equal parts diplomatic stage, family neighborhood, and the setting where the Borg, Q, and fate itself kept knocking.",
    "AtAGlance": {
      "WhatFansRemember": [
        "The warm, lived-in aesthetic: carpeted decks, soft lighting, and that unmistakable “this is home” ambience",
        "Ten Forward’s forward windows and Guinan’s calm presence when the ship (and the crew) needed perspective",
        "Saucer separation—less a gimmick than a statement about protecting civilians first",
        "Locutus on the viewscreen and the uneasy feeling that the Federation finally met something it couldn’t talk down",
        "The three-nacelle future refit from “All Good Things...” and the idea that the ship could grow old with its crew",
        "The Veridian III crash: the most iconic starship ‘death’ shot of the era, equal parts spectacle and heartbreak"
      ],
      "CrewComplement": "Built to carry a large Starfleet crew plus civilians and families—often portrayed as a small city in space rather than a purely military vessel.",
      "TopSpeed": "Designed for sustained deep-space cruising and rapid crisis response; the show leans on capability more than hard numbers.",
      "FleetRole": "Federation flagship / deep-space explorer / mobile diplomatic headquarters."
    },
    "WhyItMatters": {
      "InUniverse": "The Enterprise-D is the Federation at peak confidence: a ship designed not just to survive the frontier, but to bring civilization with it—schools, families, concerts, diplomacy, and a lot of science. When trouble hits, that same choice raises the stakes: every red alert is about protecting a community, not just a crew.",
      "InFranchiseHistory": "It redefined what a hero ship could feel like. Earlier Enterprises were adventurous and lean; the D is expansive and humane. The result is a setting that can hold courtroom drama, first-contact wonder, and existential horror—sometimes in the same week—without ever losing its identity."
    },
    "SignatureLook": {
      "SilhouetteAndDetails": "A broad, elegant saucer with a long, graceful neck and a tucked secondary hull—the Galaxy-class profile reads as ‘civilization’ as much as ‘starship.’ The nacelles sit wide and steady, giving the ship a relaxed posture even when it’s bristling with phaser fire.",
      "InteriorsAndMood": "Comfort-forward Starfleet design: warm neutrals, wood-tone accents, generous windows, and spaces that look like people actually live there. Even the bridge feels like a workplace built for long conversations, not just combat decisions."
    },
    "OnScreenCanon": {
      "FirstOnScreenUse": "Introduced as Captain Jean-Luc Picard’s newly commissioned command in TNG’s “Encounter at Farpoint,” with the ship’s dedication plaque establishing a 2363 launch/commission window during the shakedown period.",
      "NotableCanonWindows": [
        "2363–2371: active service as the Federation flagship under Picard (with brief command periods by other officers during major crises)",
        "2364–2370: the primary setting of The Next Generation’s eight-year run of first contacts, scientific mysteries, and political flashpoints",
        "2371: crippled and lost in the Battle of Veridian III (Star Trek Generations), with the stardrive section destroyed and the saucer crash-landing on the planet",
        "2370 (frame story): used as the holodeck setting for the Enterprise finale “These Are the Voyages...” (Riker/Troi aboard during the time of TNG’s “The Pegasus”)",
        "2401: restored as a museum ship and briefly returned to action during a Borg crisis (Star Trek: Picard)"
      ],
      "AnchorMomentsForFans": [
        {
          "Moment": "The first saucer separation in “Encounter at Farpoint.”",
          "WhyItSticks": "It tells you what kind of ship this is: protect the people, then handle the threat. The D’s ‘big idea’ is baked into the visuals."
        },
        {
          "Moment": "Picard’s capture and transformation into Locutus during “The Best of Both Worlds,” with Riker forced into command.",
          "WhyItSticks": "The flagship becomes vulnerable, the crew fractures under pressure, and the show proves it can do genuine horror without abandoning its optimism."
        },
        {
          "Moment": "The war-scarred alternate Enterprise-D of “Yesterday’s Enterprise.”",
          "WhyItSticks": "Same ship, different universe—suddenly it’s a battleship. The contrast makes the prime timeline feel precious."
        },
        {
          "Moment": "The future refit Enterprise-D in “All Good Things...”",
          "WhyItSticks": "A love letter to longevity: the ship looks older, tougher, and still unmistakably itself—like the crew’s history made visible."
        },
        {
          "Moment": "The Battle of Veridian III and the saucer’s crash landing (Star Trek Generations).",
          "WhyItSticks": "It’s the rare hero-ship defeat that feels personal. You don’t just lose a vehicle—you lose a place you lived in for seven seasons."
        }
      ]
    },
    "RoleAndDoctrine": {
      "StrategicRole": "As the flagship, the Enterprise-D functions as Starfleet’s best face forward: first contact platform, diplomatic venue, scientific powerhouse, and a visible promise that the Federation’s ideals travel with its technology.",
      "TypicalMissions": "Deep-space exploration and survey work; first contact and treaty support; humanitarian evacuation and relief; high-level negotiations; rapid response to existential threats when ‘send the Enterprise’ is the message you want the quadrant to hear."
    },
    "SystemsAndCapabilities": {
      "Weapons": {
        "Primary": [
          "Phaser arrays (broad coverage and sustained fire, used for everything from precision ‘shoot the thing off the hull’ to full combat exchanges)",
          "Photon torpedoes (the escalation button when phasers aren’t enough)"
        ],
        "HowItFights": "The D rarely ‘duels’ like a smaller warship; it endures, adapts, and keeps options open. When it has to fight, it leans on coverage, power, and crew coordination—then pivots back to problem-solving the moment a shooting solution isn’t the best solution."
      },
      "Defenses": {
        "Shields": "Robust defensive shielding portrayed as capable of taking sustained punishment—until the story needs you to feel what it means when even the flagship is outmatched.",
        "SeparationAsAProtectionMove": "Saucer separation turns the ship into a strategy: remove noncombatants, then commit the stardrive section to the dangerous work."
      },
      "Propulsion": {
        "Warp": "A long-range warp drive built for extended missions and sustained cruising rather than constant ‘redline’ dramatics.",
        "Sublight": "Impulse handling that sells mass and momentum—the ship feels big, but it can still maneuver decisively when the moment demands it."
      },
      "MissionFlex": {
        "FacilitiesDepth": "The Enterprise-D’s real ‘superpower’ is how much it can carry: labs, medical capacity, holodecks, diplomatic spaces, and living areas that let the ship function as a roaming piece of the Federation.",
        "BattleBridge": "When separated, the stardrive section can be commanded from the Galaxy-class battle bridge—an on-screen reminder that the ship’s architecture was built around contingencies."
      }
    },
    "LifeAboard": {
      "DailyLife": "It’s one of the few hero ships routinely depicted as a place where people have actual lives: families raise kids, officers rehearse music, crewmates meet for drinks, and the ship hosts visitors without everything turning into a security incident (well… not every time).",
      "FamiliesAndCivilians": "The presence of families changes the tone of everything. Ten Forward becomes the social heart, and the ship’s comfort isn’t decorative—it’s policy, reflecting a Starfleet that expects to explore for years without becoming isolated or brittle.",
      "CrisisMode": "When the alarms hit, the D flips from ‘floating city’ to ‘trained machine.’ The contrast is part of the drama: you feel what’s being threatened because you’ve seen the ship at peace."
    },
    "NotableShipsAndSightings": [
      {
        "Name": "USS Enterprise (NCC-1701-D) — prime service (2363–2371)",
        "ClaimToFame": "Picard’s flagship through the defining crises of the era—Q’s trials, the Borg’s arrival, and the Federation’s hardest moral and political dilemmas.",
        "PeopleConnected": [
          "Jean-Luc Picard",
          "William T. Riker",
          "Data",
          "Geordi La Forge",
          "Worf",
          "Beverly Crusher",
          "Deanna Troi"
        ],
        "WhyFansCare": "Because it’s the ship where ‘the Federation ideal’ gets tested weekly—and somehow usually survives."
      },
      {
        "Name": "USS Enterprise (NCC-1701-D) — future refit (“All Good Things...”)",
        "ClaimToFame": "A possible future version of the ship, visibly upgraded for a harsher era and used in the finale’s time-spanning crisis.",
        "PeopleConnected": [
          "Jean-Luc Picard",
          "William T. Riker",
          "Data"
        ],
        "WhyFansCare": "It makes the Enterprise feel like it has a lifespan and a future—like the ship can age, adapt, and keep going."
      },
      {
        "Name": "USS Enterprise (NCC-1701-D) — restored museum ship (2401)",
        "ClaimToFame": "Recovered and rebuilt after Veridian III, preserved as a museum piece, then briefly returned to service during a Borg emergency.",
        "PeopleConnected": [
          "Jean-Luc Picard",
          "William T. Riker",
          "Geordi La Forge"
        ],
        "WhyFansCare": "It’s the emotional payoff of a long goodbye: the ship that ‘died’ comes back with history etched into every familiar line."
      }
    ],
    "BehindTheScenes": {
      "DesignIntent": "Designed by Andrew Probert as the next evolutionary step from earlier Enterprises—sleeker, more spacious, and visually ‘civil’ rather than militaristic, matching a show that wanted diplomacy and discovery to feel like the default mode.",
      "VisualInspiration": "Production built multiple filming models over the series’ run, refining details and proportions while keeping the instantly readable Galaxy-class silhouette—one reason the ship looks both consistent and subtly ‘improved’ as seasons progress.",
      "ProductionTriviaForFans": [
        "The Enterprise-D’s interiors intentionally emphasize comfort and usability; the ship needed to sell long-duration life, not just adventure.",
        "The battle bridge exists on screen largely because saucer separation was meant to be a real, repeatable capability—not just a pilot-episode stunt.",
        "The ship’s return in Star Trek: Picard leans hard into visual memory: familiar spaces, familiar lines, and a deliberate ‘welcome back’ vibe for long-time viewers."
      ]
    },
    "FanNotes": {
      "IfYouOnlyReadOneThing": "The Enterprise-D isn’t just a setting—it’s a promise. It looks like the Federation believes the future is worth living in, and that choice makes every threat feel like it’s trying to take a home away.",
      "WhyItStillWorksToday": [
        "It’s aspirational without being sterile: a starship that feels warm, communal, and genuinely livable.",
        "It can host any story genre—mystery, horror, politics, romance—because the ship itself is stable and human.",
        "Its ‘comfort’ isn’t fluff; it’s thematic. The D embodies what Starfleet is trying to protect.",
        "When it finally falls, it hurts—because the show spent years teaching you the ship is a place, not a prop."
      ]
    },
    "Review": "Enterprise-D is the rare hero ship that feels like a place you could actually miss. It isn’t built to look intimidating; it’s built to look confident—an enormous, elegant statement that exploration doesn’t require austerity. The corridors are wide, the lighting is warm, and the vibe is almost disarmingly domestic for a vessel that keeps stumbling into godlike beings, time fractures, and hostile empires.\n\nThat comfort is the point. The ship carries families and civilians, and it hosts diplomacy as often as it hosts danger. When Picard makes a case for principle in an observation lounge, when Guinan talks someone down in Ten Forward, when Data quietly tries to understand humanity—those moments land because the Enterprise-D feels like a working society. It’s Starfleet’s optimism rendered in architecture.\n\nThen the show weaponizes that optimism. When the Borg arrive and Picard becomes Locutus, the flagship is suddenly fragile. The Enterprise-D doesn’t just get threatened; it gets violated. Riker taking command isn’t a routine ‘captain of the week’ change—it’s a stress test of the crew’s identity, and by extension the ship’s role as the Federation’s standard-bearer.\n\nThe D’s best stories use scale as drama. It can be a courtroom, a laboratory, a refugee ship, a battlefield, and a haunted house depending on the week—and the ship never feels like it’s changing masks to fit the plot. Instead, the plot collides with what the ship already is: a community trying to stay itself under pressure.\n\nEven its ‘gimmicks’ are character. Saucer separation isn’t cool because it’s a trick shot; it’s cool because it’s a moral decision made mechanical. Separate the civilians. Take the risk with the part of the ship designed for it. That’s the Enterprise-D in one move: ethics expressed as systems design.\n\nAnd when it finally goes down at Veridian III, the loss hits with unusual weight. You’ve seen this ship at rest, you’ve watched people fall in love and raise children aboard it, you’ve lived in its spaces for years. The crash is spectacle, sure—but it’s also the end of a home. The later restoration doesn’t erase that; it reframes it as history, the way real places become museums: preserved, honored, and haunted in the best way.",
    "Notes": "Some ships in Trek are remembered for being fast or deadly. Enterprise-D is remembered for being inhabited. It’s the first hero ship that routinely shows the Federation’s ‘everyday future’—kids in school, people off duty, friends meeting for a drink—so when the episode turns dark, you feel the cost immediately.\n\nIf you want a quick litmus test for what makes the D special, watch how often the important scenes aren’t in Engineering or on the bridge. They’re in lounges, conference rooms, sickbay, and quiet corridors. The ship’s power is that it creates space for conversations, not just confrontations.\n\nThe other enduring trick is contrast. In alternate timelines (“Yesterday’s Enterprise”) the same hull suddenly feels oppressive and grim, and the show doesn’t need exposition to sell it—you already know what the ship is ‘supposed’ to feel like. When the D is wrong, you notice.\n\nFinally, the Enterprise-D has one of Trek’s best ‘afterlives.’ The destruction in Generations is definitive, but the later restoration doesn’t cheapen it; it treats the ship the way fans do: as something with a past worth preserving, and a presence powerful enough that, when it shows up again, the room gets quiet.",
    "ImageURL": "https://raw.githubusercontent.com/BigBird7827/Shi-Trek/main/Images/Enterprise-D%20(Final).png"
  },
  {
    "ID": "uss-enterprise-ncc-1701-e",
    "Name": "USS Enterprise (NCC-1701-E)",
    "Affiliation": "Federation",
    "Category": "Starship",
    "Era": "24th century (TNG films era)",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "uss-voyager-ncc-74656",
    "Name": "USS Voyager (NCC-74656)",
    "Affiliation": "Federation",
    "Category": "Starship",
    "Era": "24th century (VOY era)",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "uss-defiant-nx-74205",
    "Name": "USS Defiant (NX-74205)",
    "Affiliation": "Federation",
    "Category": "Starship",
    "Era": "24th century (DS9 era)",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "uss-excelsior-ncc-2000",
    "Name": "USS Excelsior (NCC-2000)",
    "Affiliation": "Federation",
    "Category": "Starship",
    "Era": "23rd–24th century",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "uss-reliant-ncc-1864",
    "Name": "USS Reliant (NCC-1864)",
    "Affiliation": "Federation",
    "Category": "Starship",
    "Era": "23rd century (TOS films era)",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "uss-titan",
    "Name": "USS Titan",
    "Affiliation": "Federation",
    "Category": "Starship",
    "Era": "24th–25th century",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "uss-discovery-ncc-1031",
    "Name": "USS Discovery (NCC-1031)",
    "Affiliation": "Federation",
    "Category": "Starship",
    "Era": "23rd century (DIS era)",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "klingon-bird-of-prey",
    "Name": "Klingon Bird-of-Prey",
    "Affiliation": "Klingon Empire",
    "Category": "Vessel type",
    "Era": "23rd–24th century",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "klingon-neghvar",
    "Name": "Negh'Var-class warship",
    "Affiliation": "Klingon Empire",
    "Category": "Ship class",
    "Era": "24th century (DS9 era)",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "klingon-ktinga",
    "Name": "K't'inga-class battlecruiser",
    "Affiliation": "Klingon Empire",
    "Category": "Ship class",
    "Era": "23rd–24th century",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "klingon-vorcha",
    "Name": "Vor'cha-class attack cruiser",
    "Affiliation": "Klingon Empire",
    "Category": "Ship class",
    "Era": "24th century (TNG/DS9 era)",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "romulan-warbird",
    "Name": "Romulan Warbird",
    "Affiliation": "Romulan Star Empire",
    "Category": "Vessel type",
    "Era": "24th century (TNG era)",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "borg-cube",
    "Name": "Borg Cube",
    "Affiliation": "Borg Collective",
    "Category": "Vessel type",
    "Era": "24th century+",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "borg-sphere",
    "Name": "Borg Sphere",
    "Affiliation": "Borg Collective",
    "Category": "Vessel type",
    "Era": "24th century+",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "ferengi-dkora-class",
    "Name": "D'Kora-class Marauder",
    "Affiliation": "Ferengi Alliance",
    "Category": "Ship class",
    "Era": "24th century",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "vulcan-cruiser",
    "Name": "Vulcan cruiser",
    "Affiliation": "Vulcan High Command",
    "Category": "Vessel type",
    "Era": "22nd–23rd century",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "andorian-battle-cruiser",
    "Name": "Andorian battle cruiser",
    "Affiliation": "Andorian Empire",
    "Category": "Vessel type",
    "Era": "22nd–23rd century",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "species-8472",
    "Name": "Species 8472",
    "Affiliation": "Species 8472",
    "Category": "Species",
    "Era": "24th century (VOY era)",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "delta-flyer",
    "Name": "Delta Flyer",
    "Affiliation": "Federation",
    "Category": "Small craft",
    "Era": "24th century (VOY era)",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "shuttlecraft-galileo",
    "Name": "Shuttlecraft Galileo",
    "Affiliation": "Federation",
    "Category": "Small craft",
    "Era": "23rd century (TOS era)",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  },
  {
    "ID": "danube-class-runabout",
    "Name": "Danube-class runabout",
    "Affiliation": "Federation",
    "Category": "Small craft",
    "Era": "24th century (TNG/DS9 era)",
    "Tagline": "",
    "Review": "",
    "Notes": "",
    "ImageURL": ""
  }
]
